# Path Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfigurationInfo..::..Path Property
FabricationConfigurationInfo Class See Also
---
The path where the fabrication configuration is located. To populate this property, you may need to call FindSourceFabricationConfiguration first.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string Path { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Path As String
	Get
```

Visual C++
---
```text
public:
property String^ Path {
	String^ get ();
}
```

# See Also
FabricationConfigurationInfo Class
Autodesk.Revit.DB Namespace